            ////Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Введите первое число->");
// int NumberA = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите Второе число->");
// int NumberB = Convert.ToInt32(Console.ReadLine());

//    if ( NumberA > NumberB)
//        {
//         Console.WriteLine(NumberA + "Максимальное число");
//         Console.WriteLine(NumberB + "Минимальное число");
//        }
//     else 
//     {
//         Console.WriteLine(NumberB + "Максимальное число");
//         Console.WriteLine(NumberA + "Минимальное число");
//     }



            ////Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.Write("Введите первое число ->");
// int NumberA = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число ->");
// int NumberB = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число ->");
// int NumberC = Convert.ToInt32(Console.ReadLine());
// int max;

//     if (NumberA > NumberB)
//         {
//         max = NumberA;
//         Console.WriteLine (max + " Максимальное число ");
//         }
//     else if (NumberB > NumberC)
//         {
//             max = NumberB;
//             Console.WriteLine (max + " Максимальное число ");
//         }
//     else if (NumberC > NumberA)
//         {
//             max = NumberC;
//             Console.WriteLine (max + " Максимальное число ");
//         }
//     else if (NumberA > NumberC)
//         {
//             max = NumberA;
//             Console.WriteLine (max + " Максимальное число ");
//         }
//     else 
//         {
//             Console.WriteLine(" Некорретный ввод ");
//         }


           ////Задача 6:Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка)

// Console.Write("Введите число для проверки на четность->");
// int NumberA = Convert.ToInt32(Console.ReadLine());

//     if (NumberA % 2 == 0)
//         {
//              Console.WriteLine(NumberA + " Число четное ");
//         }
//     else
//         {
//             Console.WriteLine(NumberA + " Число не четное ");
//         }



            ////Задача 8:Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.


// Console.Write(" Введите число ");
// int NumberA = Convert.ToInt32(Console.ReadLine());

//     for (int start = 0; start <= NumberA; start++)
//             {
//                 if ( NumberA % 2 == 0 )
//                 Console.Write(start + " ");
//              }


// //Задача 5: Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N


// Console.Write(" Введите число ");
// int NumberA = Convert.ToInt32(Console.ReadLine());
// int start = -NumberA;

//         while (start <= NumberA)
//             {
//                 Console.Write(start);
//                 start++;
//              }
      
// Задача 7: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.


// Console.Write(" Введите трехзначное число ");
// int NumberA = Convert.ToInt32(Console.ReadLine());
// int NumberB = 0;

//   if (NumberB <= NumberA)
//     {
//             NumberB = NumberA % 10;
//             Console.WriteLine(NumberB + " Последняя цифра числа ");
//     }
//   else
//     {
//         Console.WriteLine("Вы ввели не трехзначное число"); 
//     }

  
  








